In [1]:
import pandas as pd

In [3]:
books = pd.read_csv("C:/Users/Mario/Desktop/Data_Visualization/Numpy y Pandas/Pandas/bestsellers-with-categories_e591527f-ae45-4fa5-b0d1-d50142128fa6.csv", sep=',', header=0)

In [5]:
books.head()

,Name,Author,User Rating,Reviews,Price,Year,Genre
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8,2016,Non Fiction
1,11/22/63: A Novel,Stephen King,4.6,2052,22,2011,Fiction
2,12 Rules for Life: An Antidote to Chaos,Jordan B. Peterson,4.7,18979,15,2018,Non Fiction
3,1984 (Signet Classics),George Orwell,4.7,21424,6,2017,Fiction
4,"5,000 Awesome Facts (About Everything!) (Natio...",National Geographic Kids,4.8,7665,12,2019,Non Fiction

# PIVOT

In [17]:
books.pivot_table(index='Genre',columns='Year', values='User Rating', aggfunc='sum')

Year,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
Genre,,,,,,,,,,,
Fiction,110.2,92.3,97.0,94.4,109.1,134.3,79.1,89.6,113.7,99.5,96.4
Non Fiction,119.0,135.6,130.9,132.2,118.6,96.8,153.3,144.3,119.3,133.9,140.6

In [20]:
books[(books['Year'] == 2009) & (books['Genre'] == 'Fiction')].sum()

Name           Breaking Dawn (The Twilight Saga, Book 4)Dead ...
Author         Stephenie MeyerCharlaine HarrisJeff KinneyJeff...
User Rating                                                110.2
Reviews                                                   156824
Price                                                        374
Year                                                       48216
Genre          FictionFictionFictionFictionFictionFictionFict...
dtype: object

# MELT

In [27]:
books[['Name','Genre']].head(5).melt()

  variable                                              value
0     Name                      10-Day Green Smoothie Cleanse
1     Name                                  11/22/63: A Novel
2     Name            12 Rules for Life: An Antidote to Chaos
3     Name                             1984 (Signet Classics)
4     Name  5,000 Awesome Facts (About Everything!) (Natio...
5    Genre                                        Non Fiction
6    Genre                                            Fiction
7    Genre                                        Non Fiction
8    Genre                                            Fiction
9    Genre                                        Non Fiction

In [26]:
books.melt(id_vars='Year',value_vars='Genre')

                       Author variable       Prueba
0                    JJ Smith    Genre  Non Fiction
1                Stephen King    Genre      Fiction
2          Jordan B. Peterson    Genre  Non Fiction
3               George Orwell    Genre      Fiction
4    National Geographic Kids    Genre  Non Fiction
..                        ...      ...          ...
545               Jeff Kinney    Genre      Fiction
546               Jen Sincero    Genre  Non Fiction
547               Jen Sincero    Genre  Non Fiction
548               Jen Sincero    Genre  Non Fiction
549               Jen Sincero    Genre  Non Fiction

[550 rows x 3 columns]